function generateSongText() {
  for (let i = 99; i > 0; i--) {
    generateSingleStanza(i);
  }
}

function generateSingleStanza(num) {
  let res = "";
  if (
    (num > 2 && num <= 4) ||
    (num > 2 && num <= 20) ||
    (num > 5 && num <= 30) ||
    (num > 34 && num <= 40) ||
    (num > 44 && num <= 50) ||
    (num > 54 && num <= 60) ||
    (num > 64 && num <= 70) ||
    (num > 74 && num <= 80) ||
    (num > 84 && num <= 90) ||
    (num > 95 && num <= 99)
  ) {
    res += `${num} бутылок пива на стене, ${num} бутылок пива!
      Возьми одну, пусти по кругу, ${num - 1} бутылок пива на стене!`;
  }
  if (
    // (num > 2 && num <= 4) ||
    num === 5 ||
    num === 25 ||
    num === 35 ||
    num === 45 ||
    num === 55 ||
    num === 65 ||
    num === 75 ||
    num === 85 ||
    num === 95
  ) {
    res = `${num} бутылок пива на стене, ${num} бутылок пива!
      Возьми одну, пусти по кругу, ${num - 1} бутылки пива на стене!`;
  }
  if (
    (num > 2 && num <= 4) ||
    (num > 22 && num < 25) ||
    (num > 32 && num <= 34) ||
    (num > 42 && num <= 44) ||
    (num > 52 && num <= 54) ||
    (num > 62 && num <= 64) ||
    (num > 72 && num <= 74) ||
    (num > 82 && num <= 84) ||
    (num > 92 && num <= 94)
  ) {
    res = `${num} бутылки пива на стене, ${num} бутылки пива!
      Возьми одну, пусти по кругу, ${num - 1} бутылки пива на стене!`;
  }
  if (
    num === 2 ||
    num === 22 ||
    num === 32 ||
    num === 42 ||
    num === 52 ||
    num === 62 ||
    num === 72 ||
    num === 82 ||
    num === 92
  ) {
    res = `${num} бутылки пива на стене, ${num} бутылки пива!
      Возьми одну, пусти по кругу, ${num - 1} бутылка пива на стене!`;
  }
  if (
    num === 1 ||
    num === 21 ||
    num === 31 ||
    num === 41 ||
    num === 51 ||
    num === 61 ||
    num === 71 ||
    num === 81 ||
    num === 91
  ) {
    res = `${num} бутылка пива на стене, ${num} бутылка пива!
      Возьми одну, пусти по кругу, ${num - 1} бутылок пива на стене!`;
  }
  return console.log(res);
}

generateSongText();
